{
  "[0].away.text": "Le site web final s'est parfaitement aligné avec l'identité et les objectifs commerciaux de Caché, offrant une expérience utilisateur fluide et engageante. Le projet a souligné l'importance de l'équilibre entre esthétique et fonctionnalité, notamment dans le secteur de la restauration où la première impression compte. Cette étude de cas met en évidence l'impact d'une conception UX/UI réfléchie sur l'expérience numérique d'une marque et sur la fluidité des interactions en ligne des clients.",
  "[0].away.title": "Plats à emporter",
  "[0].cover": "work01-hover.webp",
  "[0].details[0].box": "<h3>Aperçu</h3><h4> Chronologie:</h4><p> Novembre 2024 - Janvier 2025</p><h4> Rôle:</h4><p> Conception de produits (UX/UI) - Développeur Web</p><h4> Outils:</h4><p> Figma, WordPress, HTML, CSS</p>",
  "[0].details[0].txt": "<h3>Contexte et défi</h3><p> Caché est un bistrot de quartier moderne de San Francisco qui allie l'ambiance décontractée d'un bistrot français à des expériences culinaires contemporaines. Le restaurant avait besoin d'une présence numérique qui reflète son identité, fournisse des informations essentielles et facilite les réservations, tout en optimisant son utilisation pour les utilisateurs sur ordinateur et mobile.</p><p> Le défi était de créer un site Web qui non seulement mettait en valeur la personnalité unique de la marque, mais offrait également une expérience utilisateur transparente aux clients recherchant des détails sur le menu, les réservations et les événements.</p>",
  "[0].details[0].type": "boxtxt",
  "[0].details[1].alt": "Moodboard Caché",
  "[0].details[1].img": "work01/moodboard_cache.webp",
  "[0].details[1].txt": "<h3>Comprendre le public</h3> Pour garantir que le site Web réponde aux besoins des clients, j'ai identifié trois groupes d'audience clés :<ol><li> Résidents locaux et touristes : à la recherche d'une expérience culinaire raffinée mais accueillante.</li><li> Passionnés de gastronomie et Millennials : Intéressés par la gastronomie moderne et les vins naturels.</li><li> Dîners décontractés et occasions spéciales : Explorez les options pour le brunch, l'happy hour ou le dîner.</li></ol>",
  "[0].details[1].type": "txtimg",
  "[0].details[2].lines[0]": "Le design a mis l'accent sur l'élégance et la chaleur, reflétant l'atmosphère à la fois chaleureuse et sophistiquée du bistrot. Les éléments clés comprenaient :",
  "[0].details[2].lines[1]": "<ol><li>Palette de couleurs</li><p> J'ai sélectionné une teinte terre cuite (#B86C51) qui évoque la chaleur et une sensation naturelle, complétée par un fond blanc cassé (#FBEBD9) pour créer une esthétique propre et aérée.</p>",
  "[0].details[2].lines[2]": "<img class='work-img' src='/assets/images/work01/colorpalette_cache.webp' alt=\"Palette de couleurs cachée\"/><img class='work-img' src='/assets/images/work01/logo_cache.webp' alt=\"Logo Caché\"/>",
  "[0].details[2].lines[3]": "<ol start='2'><li>Conception de logo personnalisé</li><p> Au lieu d'utiliser une police existante, j'ai écrit le nom du restaurant à la main sur papier, je l'ai scanné et vectorisé pour créer une identité de marque unique et personnelle. Cela a donné au logo un aspect artisanal et distinctif.</p></ol>",
  "[0].details[2].title": "Approche et stratégie de conception",
  "[0].details[2].type": "txt",
  "[0].details[3].alt": "Typographie Caché",
  "[0].details[3].img": "work01/typography_cache.webp",
  "[0].details[3].txt": "<ol start='3'><li>Typographie</li> Les principales polices de texte sont Ruffina pour son caractère raffiné et expressif, associé à Lato pour un contraste moderne et très lisible.<li> Icônes et accents visuels</li> J'ai conçu des icônes personnalisées supplémentaires, notamment un logo Instagram, un poisson et une carotte, permettant au client d'ajouter des marqueurs visuels pour les médias sociaux, les fruits de mer ou les plats végétariens.<img class='work-img50' src='/assets/images/work01/icons_cache.webp' alt=\"Icônes cachées\"/></ol>",
  "[0].details[3].type": "txtimg",
  "[0].details[4].alt": "WordPress Caché",
  "[0].details[4].img": "work01/wordpress_cache.webp",
  "[0].details[4].txt": "<h3>Développement et mise en œuvre</h3> L'utilisation de WordPress comme CMS a permis une gestion de contenu flexible tout en garantissant des performances optimales. Des codes HTML et CSS personnalisés ont été intégrés pour peaufiner le style au-delà des modèles standards, garantissant ainsi la cohérence de la marque. Parmi les optimisations spécifiques, on peut citer :<ul><li> Un système de menu et de réservation entièrement réactif</li><li> Pages à chargement rapide avec contenu multimédia optimisé</li><li> Meilleures pratiques SEO pour améliorer la découvrabilité</li></ul>",
  "[0].details[4].type": "txtimg",
  "[0].id": "01",
  "[0].label": "Découvrir",
  "[0].link": "https://cache-sf.com",
  "[0].next": "02",
  "[0].pictures[0]": "work01-hover.webp",
  "[0].pictures[1]": "work01-hover.webp",
  "[0].pictures[2]": "work01-hover.webp",
  "[0].previous": "03",
  "[0].role": "Conception de produits (UX/UI) - Développeur Web",
  "[0].tags[0]": "interface utilisateur",
  "[0].tags[1]": "UX",
  "[0].tags[2]": "Développeur",
  "[0].text": "Conception et développement d'un bistrot français à San Francisco.",
  "[0].title": "Caché - San Francisco",
  "[0].tools[0]": "Figma",
  "[0].tools[1]": "WordPress",
  "[0].tools[2]": "HTML",
  "[0].tools[3]": "CSS",
  "[0].year": "Novembre 2024 - Janvier 2025",
  "[1].away.text[0]": "TheCollectible a réussi à rapprocher les collectionneurs et les artistes grâce à une approche centrée sur l'utilisateur, rigoureusement étudiée. En intégrant la recherche UX à l'exécution technique, j'ai créé une place de marché alliant esthétique, fonctionnalité et viabilité commerciale, démontrant ainsi l'impact d'un design réfléchi sur l'expérience numérique.",
  "[1].away.title": "Plats à emporter",
  "[1].cover": "work02-hover.webp",
  "[1].details[0].box": "<h3>Contexte</h3><p> TheCollectible est une initiative entrepreneuriale que j'ai cofondée pour créer une place de marché conviviale dédiée à l'art et aux objets de collection. En tant que CTO, j'ai dirigé la direction technique tout en contribuant activement à la recherche et à la conception UX. Cette expérience a renforcé ma capacité à concilier stratégie commerciale, besoins utilisateurs et contraintes techniques.</p>",
  "[1].details[0].txt": "<h3>Le Brief</h3><p> L'étude a identifié les principaux points faibles : la difficulté d'accès aux œuvres d'art, d'évaluation des objets de collection et de navigation sur les plateformes existantes. Les utilisateurs avaient besoin d'une place de marché fiable et intuitive, proposant des transactions fluides et un contenu sélectionné.</p>",
  "[1].details[0].type": "boîtetxt",
  "[1].details[1].lines[0]": "<li>Recherche et stratégie utilisateur</li>",
  "[1].details[1].lines[1]": "<p>Pour comprendre le comportement et les besoins des utilisateurs, j'ai mené des entretiens et des enquêtes, ce qui a permis de créer des profils utilisateurs représentatifs de nos publics clés. Ces profils ont guidé la prise de décision tout au long du processus de conception. Sur la base de ces recherches, j'ai conçu un parcours utilisateur pour fluidifier les interactions et garantir une expérience intuitive, de la découverte à l'achat.</p>",
  "[1].details[1].lines[10]": "<li>Déploiement et mise à l'échelle</li>",
  "[1].details[1].lines[11]": "<p>La plateforme a été lancée sur une infrastructure cloud, permettant une évolutivité efficace. Les efforts post-lancement ont porté sur la surveillance des performances, le débogage et le déploiement de nouvelles fonctionnalités basées sur l'engagement des utilisateurs.</p>",
  "[1].details[1].lines[2]": "<li>Image de marque et identité visuelle</li>",
  "[1].details[1].lines[3]": "<p>Afin de créer une expérience cohérente, j'ai créé une identité de marque et un logo, garantissant une cohérence visuelle sur tous les points de contact. Un système de conception a été développé pour préserver l'harmonie entre les interfaces web et mobiles.</p>",
  "[1].details[1].lines[4]": "<li>Wireframing et prototypage</li>",
  "[1].details[1].lines[5]": "<p>Grâce à Figma, j'ai créé des wireframes basse fidélité pour structurer les interactions principales avant de les affiner en prototypes haute fidélité. Ces prototypes ont été testés de manière itérative auprès des utilisateurs, validant ainsi leur ergonomie avant le développement.</p>",
  "[1].details[1].lines[6]": "<li>Développement technique</li>",
  "[1].details[1].lines[7]": "<p>La plateforme a été développée avec Flutter pour une expérience multiplateforme fluide, associée à une infrastructure back-end évolutive. J'ai veillé à ce que les informations UX se traduisent par une interface performante et accessible. Les méthodologies agiles ont permis une itération continue basée sur les retours des utilisateurs.</p>",
  "[1].details[1].lines[8]": "<li>Tests et perfectionnement</li>",
  "[1].details[1].lines[9]": "<p>Au cours de plusieurs phases de test, j'ai affiné des fonctionnalités telles que le processus de référencement et la fonctionnalité de recherche, garantissant une expérience sans friction.</p>",
  "[1].details[1].subtitle": "Le processus a suivi une approche UX structurée :",
  "[1].details[1].title": "Le développement",
  "[1].details[1].type": "liste de textes",
  "[1].id": "02",
  "[1].label": "En savoir plus",
  "[1].link": "",
  "[1].next": "03",
  "[1].pictures[0]": "work02-hover.webp",
  "[1].previous": "01",
  "[1].role": "Conception de produits (UX/UI) - Développeur Web",
  "[1].tags[0]": "interface utilisateur",
  "[1].tags[1]": "UX",
  "[1].tags[2]": "Développeur",
  "[1].text": "Projet d'entrepreneur créé de toutes pièces.",
  "[1].title": "L'objet de collection",
  "[1].tools[0]": "Figma",
  "[1].tools[1]": "WordPress",
  "[1].tools[2]": "HTML",
  "[1].tools[3]": "CSS",
  "[1].year": "Juillet 2024 - Août 2024",
  "[2].away.text[0]": "Ce projet a su allier une expérience utilisateur engageante à une solution pratique et autogérée pour le client. En concevant une interface visuellement attrayante et intuitive, j'ai permis aux utilisateurs de naviguer facilement sur la plateforme de radio en ligne et de profiter d'une expérience d'écoute fluide.",
  "[2].away.text[1]": "L'ajout d'un panneau d'administration sur mesure a permis au client de gérer son contenu de manière autonome, garantissant ainsi un site web dynamique et à jour sans intervention technique. Grâce à un design réactif, un back-end robuste et un système de gestion de contenu convivial, le produit final a non seulement répondu aux attentes du client, mais les a même dépassées.",
  "[2].away.text[2]": "Cette étude de cas met en évidence ma capacité à équilibrer l’esthétique, la fonctionnalité et l’autonomie de l’utilisateur, éléments clés pour créer des expériences numériques percutantes.",
  "[2].away.title": "Plats à emporter",
  "[2].cover": "work03-hover.webp",
  "[2].details[0].box": "<h3>Contexte</h3><p> Le client avait besoin d'un site web de radio en ligne proposant des mix SoundCloud, avec un design reflétant leur esthétique rétro. L'interface devait être intuitive et réactive, offrant une expérience d'écoute fluide.</p><p> Le client souhaitait également pouvoir gérer lui-même son site web à l'avenir, en ajoutant de nouveaux mix et images d'arrière-plan. J'ai donc choisi d'ajouter un panneau d'administration, lui permettant d'effectuer des modifications mineures de manière autonome, sans expertise technique.</p>",
  "[2].details[0].txt": "",
  "[2].details[0].type": "boîtetxt",
  "[2].details[1].lines[0]": "La première étape consistait à concevoir la maquette et la page principale afin d'offrir une expérience utilisateur fluide, avec notamment des widgets audio intégrés, des arrière-plans dynamiques et des commandes réactives. Je me suis attaché à créer une mise en page adaptable aux ordinateurs de bureau et aux appareils mobiles, en privilégiant une interface de lecture unique et conviviale.",
  "[2].details[1].lines[1]": "Au-delà de la conception de la page principale, j'ai ensuite travaillé sur la création du panneau d'administration, qui est devenu la pierre angulaire de la réussite durable de ce projet. La page d'administration a été conçue en PHP et MySQL, qui s'intègrent parfaitement au site web. Elle offre un système de connexion simple et sécurisé et permet au client de :",
  "[2].details[1].lines[2]": "<ul><li>Téléchargez de nouveaux liens SoundCloud à ajouter en tant que mix dans la file d'attente radio.</li><li> Gérer les images d'arrière-plan utilisées pour le site, leur permettant de mettre à jour les visuels au fur et à mesure de l'évolution de la marque.</li><li> Modifiez ou supprimez le contenu précédemment téléchargé, offrant un contrôle total sur l'expérience utilisateur.</li></ul>",
  "[2].details[1].lines[3]": "Pour la base de données, j'ai conçu une solution évolutive qui stocke à la fois les pistes et les ressources associées. J'ai créé des tables pour gérer les mixages et les images d'arrière-plan indépendamment, permettant ainsi à l'administrateur d'ajouter, de modifier ou de supprimer facilement des entrées sans perturber les fonctionnalités du site.",
  "[2].details[1].lines[4]": "L'interface back-end a été conçue pour être intuitive, avec des formulaires de saisie simples et des fonctions glisser-déposer lorsque nécessaire. Chaque page d'administration était accompagnée d'instructions succinctes pour que même une personne ayant des connaissances techniques limitées puisse utiliser l'outil en toute confiance.",
  "[2].details[1].lines[5]": "<ol><li>Palette de couleurs</li></ol> Pouvez-vous imaginer quelque chose de plus simple ?",
  "[2].details[1].lines[6]": "<img  class='work-img' src='/assets/images/work03/colorpalette_divorce.webp' alt=\"Palette de couleurs Divorce\"/>",
  "[2].details[1].title": "Approche et développement",
  "[2].details[1].type": "SMS",
  "[2].id": "03",
  "[2].label": "En savoir plus",
  "[2].link": "https://divorce.fm",
  "[2].next": "01",
  "[2].pictures[0]": "",
  "[2].previous": "",
  "[2].role": "",
  "[2].tags[0]": "",
  "[2].text": "",
  "[2].title": "",
  "[2].tools[0]": "",
  "[2].tools[1]": "",
  "[2].tools[2]": "",
  "[2].tools[3]": "",
  "[2].year": ""
}
