{
  "[0].away.text": "Il sito web finale si è allineato con successo all'identità e agli obiettivi aziendali di Caché, offrendo un'esperienza utente fluida e coinvolgente. Il progetto ha rafforzato l'importanza di bilanciare estetica e funzionalità, in particolare nel settore della ristorazione, dove le prime impressioni sono importanti. Questo studio di caso evidenzia l'impatto di un design UX/UI ponderato nel dare forma all'esperienza digitale di un marchio e nel garantire che i clienti possano interagire senza problemi con un'azienda online.",
  "[0].away.title": "Da asporto",
  "[0].cover": "lavoro01-hover.webp",
  "[0].details[0].box": "<h3>Panoramica</h3><h4> Cronologia:</h4><p> Novembre 2024 - Gennaio 2025</p><h4> Ruolo:</h4><p> Progettazione del prodotto (UX/UI) - Sviluppatore web</p><h4> Utensili:</h4><p> Figma, WordPress, HTML, CSS</p>",
  "[0].details[0].txt": "<h3>Contesto e sfida</h3><p> Caché è un moderno bistrot di quartiere a San Francisco che fonde un'atmosfera rilassata da bistrot francese con esperienze culinarie contemporanee. Il ristorante aveva bisogno di una presenza digitale che riflettesse la sua identità, fornisse informazioni essenziali e facilitasse le prenotazioni, ottimizzando al contempo sia gli utenti desktop che quelli mobili.</p><p> La sfida era creare un sito web che non solo mettesse in mostra la personalità unica del marchio, ma che offrisse anche un'esperienza utente fluida per i clienti che cercavano informazioni sul menu, sulle prenotazioni e sugli eventi.</p>",
  "[0].details[0].type": "boxtxt",
  "[0].details[1].alt": "Moodboard Caché",
  "[0].details[1].img": "work01/moodboard_cache.webp",
  "[0].details[1].txt": "<h3>Comprendere il pubblico</h3> Per garantire che il sito web fosse in linea con le esigenze dei clienti, ho identificato tre gruppi di pubblico chiave:<ol><li> Residenti locali e turisti: alla ricerca di un'esperienza culinaria raffinata ma accogliente.</li><li> Appassionati di cibo e Millennials: interessati alla gastronomia moderna e ai vini naturali.</li><li> Ristoranti informali e per occasioni speciali: scopri le opzioni per brunch, happy hour o cene.</li></ol>",
  "[0].details[1].type": "txtimg",
  "[0].details[2].lines[0]": "Il design si è concentrato su eleganza e calore, catturando l'atmosfera invitante ma sofisticata del bistrot. Gli elementi chiave includevano:",
  "[0].details[2].lines[1]": "<ol><li>Palette di colori</li><p> Ho selezionato una tonalità terracotta (#B86C51) che evoca calore e una sensazione naturale, completata da uno sfondo bianco sporco (#FBEBD9) per creare un'estetica pulita e ariosa.</p>",
  "[0].details[2].lines[2]": "<img class='work-img' src='/assets/images/work01/colorpalette_cache.webp' alt=\"Palette di colori Caché\"/><img class='work-img' src='/assets/images/work01/logo_cache.webp' alt=\"Logo nascosto\"/>",
  "[0].details[2].lines[3]": "<ol start='2'><li>Progettazione logo personalizzata</li><p> Invece di usare un font esistente, ho scritto a mano il nome del ristorante su un foglio di carta, l'ho scansionato e l'ho vettorializzato per creare un'identità di marca unica e personale. Ciò ha dato al logo un aspetto artigianale e distintivo.</p></ol>",
  "[0].details[2].title": "Approccio e strategia di progettazione",
  "[0].details[2].type": "txt",
  "[0].details[3].alt": "Tipografia Caché",
  "[0].details[3].img": "work01/typography_cache.webp",
  "[0].details[3].txt": "<ol start='3'><li>Tipografia</li> I principali caratteri di testo sono Ruffina, per il suo carattere raffinato ed espressivo, abbinato a Lato, per un contrasto moderno e altamente leggibile.<li> Icone e accenti visivi</li> Ho progettato altre icone personalizzate, tra cui un logo Instagram, un pesce e una carota, lasciando al cliente la flessibilità di aggiungere marcatori visivi per i social media, i frutti di mare o i piatti vegetariani. <img class='work-img50' src='/assets/images/work01/icons_cache.webp' alt=\"Icone memorizzate nella cache\"/></ol>",
  "[0].details[3].type": "txtimg",
  "[0].details[4].alt": "Cache di WordPress",
  "[0].details[4].img": "lavoro01/wordpress_cache.webp",
  "[0].details[4].txt": "<h3>Sviluppo e implementazione</h3> L'utilizzo di WordPress come CMS ha consentito una gestione flessibile dei contenuti, garantendo al contempo prestazioni fluide. Sono stati incorporati HTML e CSS personalizzati per perfezionare lo stile oltre i template standard, garantendo la coerenza del marchio. Le ottimizzazioni specifiche includevano:<ul><li> Un sistema di menu e prenotazione completamente reattivo</li><li> Pagine a caricamento rapido con contenuti multimediali ottimizzati</li><li> Le migliori pratiche SEO per migliorare la rilevabilità</li></ul>",
  "[0].details[4].type": "testoimmagine",
  "[0].id": "01",
  "[0].label": "Scoprire",
  "[0].link": "Italiano: https://cache-sf.com",
  "[0].next": "02",
  "[0].pictures[0]": "lavoro01-hover.webp",
  "[0].pictures[1]": "lavoro01-hover.webp",
  "[0].pictures[2]": "lavoro01-hover.webp",
  "[0].previous": "03",
  "[0].role": "Progettazione del prodotto (UX/UI) - Sviluppatore web",
  "[0].tags[0]": "Interfaccia utente",
  "[0].tags[1]": "Esperienza utente",
  "[0].tags[2]": "Sviluppatore",
  "[0].text": "Progettazione e sviluppo di un bistrot francese a San Francisco.",
  "[0].title": "Nascondiglio - San Francisco",
  "[0].tools[0]": "Figma",
  "[0].tools[1]": "Parola chiave",
  "[0].tools[2]": "Codice HTML",
  "[0].tools[3]": "Codice CSS",
  "[0].year": "Novembre 2024 - Gennaio 2025",
  "[1].away.text[0]": "TheCollectible ha colmato con successo il divario tra collezionisti e artisti attraverso un approccio ben studiato e incentrato sull'utente. Integrando la ricerca UX con l'esecuzione tecnica, ho creato un mercato che bilanciava estetica, funzionalità e fattibilità aziendale, dimostrando l'impatto di un design ponderato nel dare forma alle esperienze digitali.",
  "[1].away.title": "Da asporto",
  "[1].cover": "lavoro02-hover.webp",
  "[1].details[0].box": "<h3>Contesto</h3><p> TheCollectible è un'iniziativa imprenditoriale che ho co-fondato per creare un mercato user-friendly per arte e oggetti da collezione. Come CTO, ho guidato la direzione tecnica contribuendo attivamente alla ricerca e alla progettazione UX. Questa esperienza ha rafforzato la mia capacità di bilanciare strategia aziendale, esigenze degli utenti e vincoli tecnici.</p>",
  "[1].details[0].txt": "<h3>Il breve</h3><p> La ricerca ha identificato i principali punti dolenti: difficoltà nell'accesso all'arte, nella valutazione degli oggetti da collezione e nella navigazione delle piattaforme esistenti. Gli utenti avevano bisogno di un marketplace affidabile e intuitivo con transazioni fluide e contenuti curati.</p>",
  "[1].details[0].type": "testo della casella",
  "[1].details[1].lines[0]": "<li>Ricerca e strategia degli utenti</li>",
  "[1].details[1].lines[1]": "<p>Per comprendere il comportamento e le esigenze degli utenti, ho condotto interviste e sondaggi, che hanno portato alla creazione di profili utente che rappresentavano i nostri pubblici chiave. Questi profili hanno guidato il processo decisionale durante tutto il processo di progettazione. Sulla base di questa ricerca, ho progettato un flusso utente per mappare interazioni fluide, garantendo un'esperienza intuitiva dalla scoperta all'acquisto.</p>",
  "[1].details[1].lines[10]": "<li>Distribuzione e scalabilità</li>",
  "[1].details[1].lines[11]": "<p>La piattaforma è stata lanciata su un'infrastruttura cloud, consentendo un ridimensionamento efficiente. Gli sforzi post-lancio si sono concentrati sul monitoraggio delle prestazioni, sul debug e sull'implementazione di nuove funzionalità basate sul coinvolgimento degli utenti.</p>",
  "[1].details[1].lines[2]": "<li>Branding e identità visiva</li>",
  "[1].details[1].lines[3]": "<p>Per creare un'esperienza coesa, ho creato un'identità di marca e un logo, assicurando coerenza visiva in tutti i touchpoint. È stato sviluppato un sistema di progettazione per mantenere l'armonia tra le interfacce web e mobile.</p>",
  "[1].details[1].lines[4]": "<li>Wireframing e prototipazione</li>",
  "[1].details[1].lines[5]": "<p>Utilizzando Figma, ho creato wireframe a bassa fedeltà per strutturare le interazioni principali prima di perfezionarle in prototipi ad alta fedeltà. Questi sono stati testati in modo iterativo con gli utenti, convalidandone l'usabilità prima dello sviluppo.</p>",
  "[1].details[1].lines[6]": "<li>Sviluppo tecnico</li>",
  "[1].details[1].lines[7]": "<p>La piattaforma è stata creata utilizzando Flutter per un'esperienza multipiattaforma fluida, abbinata a un'infrastruttura back-end scalabile. Ho fatto in modo che gli insight UX si traducessero in un'interfaccia performante e accessibile. Le metodologie agili hanno consentito un'iterazione continua basata sul feedback degli utenti reali.</p>",
  "[1].details[1].lines[8]": "<li>Test e perfezionamento</li>",
  "[1].details[1].lines[9]": "<p>Attraverso molteplici fasi di test, ho perfezionato funzionalità come il processo di quotazione e la funzionalità di ricerca, garantendo un'esperienza fluida.</p>",
  "[1].details[1].subtitle": "Il processo ha seguito un approccio UX strutturato:",
  "[1].details[1].title": "Lo sviluppo",
  "[1].details[1].type": "elenco di testo",
  "[1].id": "02",
  "[1].label": "Per saperne di più",
  "[1].link": "",
  "[1].next": "03",
  "[1].pictures[0]": "lavoro02-hover.webp",
  "[1].previous": "01",
  "[1].role": "Progettazione del prodotto (UX/UI) - Sviluppatore web",
  "[1].tags[0]": "Interfaccia utente",
  "[1].tags[1]": "Esperienza utente",
  "[1].tags[2]": "Sviluppatore",
  "[1].text": "Progetto imprenditoriale creato da zero.",
  "[1].title": "Il Collezionabile",
  "[1].tools[0]": "Figma",
  "[1].tools[1]": "Parola chiave",
  "[1].tools[2]": "Codice HTML",
  "[1].tools[3]": "Codice CSS",
  "[1].year": "Luglio 2024 - Agosto 2024",
  "[2].away.text[0]": "Questo progetto ha combinato con successo un'esperienza utente coinvolgente con una soluzione pratica e autogestita per il cliente. Progettando un'interfaccia visivamente accattivante e intuitiva, ho garantito che gli utenti potessero navigare facilmente sulla piattaforma radio online e godere di un'esperienza di ascolto fluida.",
  "[2].away.text[1]": "L'aggiunta di un pannello di amministrazione personalizzato ha consentito al cliente di gestire i propri contenuti in modo indipendente, assicurando che il sito web rimanesse dinamico e aggiornato senza richiedere interventi tecnici. Con un design reattivo, un backend robusto e un sistema di gestione dei contenuti facile da usare, il prodotto finale non solo ha soddisfatto ma ha superato le aspettative del cliente.",
  "[2].away.text[2]": "Questo case study mette in luce la mia capacità di bilanciare estetica, funzionalità e autonomia dell'utente, elementi chiave per creare esperienze digitali di impatto.",
  "[2].away.title": "Da asporto",
  "[2].cover": "lavoro03-hover.webp",
  "[2].details[0].box": "<h3>Contesto</h3><p> Il cliente aveva bisogno di un sito web di radio online con mix di SoundCloud, con un design che riflettesse la loro estetica old-school. L'interfaccia doveva essere intuitiva e reattiva, per offrire un'esperienza di ascolto fluida.</p><p> Il cliente ha anche richiesto di poter gestire il sito web in autonomia in futuro, aggiungendo nuovi mix e immagini di sfondo. Pertanto, ho scelto di aggiungere un pannello di amministrazione, consentendo loro di apportare piccole modifiche in modo indipendente senza bisogno di competenze tecniche.</p>",
  "[2].details[0].txt": "",
  "[2].details[0].type": "testo della casella",
  "[2].details[1].lines[0]": "Il primo passo ha comportato il wireframing e la progettazione della pagina principale per ottenere un'esperienza utente fluida, inclusi widget audio incorporati, sfondi dinamici e controlli reattivi. Mi sono concentrato sulla fornitura di un layout che si adattasse bene ai dispositivi desktop e mobili, dando priorità a un'interfaccia del player unica ma facile da usare.",
  "[2].details[1].lines[1]": "Oltre al design della pagina principale, ho lavorato alla creazione del pannello di amministrazione, che è diventato il fondamento del successo a lungo termine di questo progetto. La pagina di amministrazione è stata realizzata utilizzando PHP e MySQL, che si sono integrati perfettamente nel sito web. Fornisce un sistema di login sicuro e facile da usare e consente al cliente di:",
  "[2].details[1].lines[2]": "<ul><li>Carica nuovi link SoundCloud da aggiungere come mix nella coda della radio.</li><li> Gestire le immagini di sfondo utilizzate per il sito, consentendo di aggiornare gli elementi visivi man mano che il marchio si evolve.</li><li> Modifica o rimuovi i contenuti caricati in precedenza, ottenendo il pieno controllo sull'esperienza utente.</li></ul>",
  "[2].details[1].lines[3]": "Per il database, ho strutturato una soluzione scalabile che memorizza sia le tracce che le risorse correlate. Ho creato tabelle per gestire mix e immagini di sfondo in modo indipendente, rendendo facile per l'amministratore aggiungere, modificare o eliminare qualsiasi voce senza interrompere la funzionalità del sito.",
  "[2].details[1].lines[4]": "L'interfaccia backend è stata progettata per essere intuitiva, con semplici moduli di input e capacità di trascinamento della selezione, ove appropriato. Ogni pagina di amministrazione era accompagnata da brevi istruzioni per garantire che anche qualcuno con conoscenze tecniche limitate potesse utilizzare lo strumento con sicurezza.",
  "[2].details[1].lines[5]": "<ol><li>Palette di colori</li></ol> Riesci a immaginare qualcosa di più semplice?",
  "[2].details[1].lines[6]": "<img  class='work-img' src='/assets/images/work03/colorpalette_divorce.webp' alt=\"Palette di colori Divorzio\"/>",
  "[2].details[1].title": "Approccio e sviluppo",
  "[2].details[1].type": "TXT",
  "[2].id": "03",
  "[2].label": "Per saperne di più",
  "[2].link": "https://divorzio.fm",
  "[2].next": "01",
  "[2].pictures[0]": "",
  "[2].previous": "",
  "[2].role": "",
  "[2].tags[0]": "",
  "[2].text": "",
  "[2].title": "",
  "[2].tools[0]": "",
  "[2].tools[1]": "",
  "[2].tools[2]": "",
  "[2].tools[3]": "",
  "[2].year": ""
}
